import React from "react";
import "./Comments.css";
import img from "../assets/comments.jpg";
import user1 from "../assets/user1.jpg";
import user2 from "../assets/user2.jpg";
import user3 from "../assets/user3.jpg";
import star from "../assets/star.svg";

function Comments() {
   const comments = [
      {
         text: "Burada həm nəzəriyyəni, həm də praktikanı öyrənmək imkanım oldu. Təlimçilər hər zaman dəstək göstərir və öyrəndiklərimi real layihələrdə tətbiq etmək çox faydalıdır.",
         name: "Elvin Abbasov",
         role: "UX/UI Dizayner",
         img: user1,
      },
      {
         text: "Kurs çox sistemli şəkildə qurulub. Ən əsası isə praktiki tapşırıqlar və layihələr sayəsində özümü real iş mühitinə hazır hiss edirəm.",
         name: "Samir Əliyev",
         role: "Data Analitik",
         img: user2,
      },
      {
         text: "Dərslər çox interaktiv keçir və daim yaradıcılığa təşviq olunur. Portfolio yaratmaqda böyük kömək gördüm və artıq freelance işlər götürməyə başlamışam.",
         name: "Aydan Səfərova",
         role: "UX/UI Dizayner",
         img: user3,
      },
      {
         text: "Mənim üçün ən dəyərli tərəf həm bilik, həm də karyera dəstəyi oldu. Kursdan sonra iş tapmaq imkanlarım xeyli artdı.",
         name: "Lalə Həsənova",
         role: "Front-End Developer",
         img: user3,
      },
   ];

   const duplicatedComments = [...comments, ...comments];

   return (
      <section className="my-32">
         <div className="container mx-auto flex justify-center gap-32">
            <div className="relative">
               <div className="absolute top-0 group hover:bg-[#6A1FCC] left-0 flex items-center gap-10 p-6 bg-white rounded-[30px] max-w-max transition-all duration-300">
                  <h5 className="group-hover:text-white text-[24px] font-semibold transition-all duration-300">
                     Tələbələrimizin <br />
                     səmimi rəyləri
                  </h5>
                  <svg className="group-hover:bg-white text-white transition-all duration-300 group-hover:text-[#6A1FCC] p-2 bg-[#6A1FCC] rounded-full" width="40" height="40" viewBox="0 0 25 24" xmlns="http://www.w3.org/2000/svg">
                     <path
                        d="M17.4699 5.09397C17.6108 4.95314 17.8018 4.87402 18.0009 4.87402C18.2001 4.87402 18.3911 4.95314 18.5319 5.09397C18.6728 5.2348 18.7519 5.42581 18.7519 5.62497C18.7519 5.82413 18.6728 6.01514 18.5319 6.15597L5.78195 18.906C5.71222 18.9757 5.62943 19.031 5.53832 19.0688C5.44721 19.1065 5.34956 19.1259 5.25095 19.1259C5.15233 19.1259 5.05468 19.1065 4.96357 19.0688C4.87246 19.031 4.78968 18.9757 4.71995 18.906C4.65022 18.8362 4.5949 18.7535 4.55716 18.6623C4.51942 18.5712 4.5 18.4736 4.5 18.375C4.5 18.2764 4.51942 18.1787 4.55716 18.0876C4.5949 17.9965 4.65022 17.9137 4.71995 17.844L17.4699 5.09397Z"
                        fill="currentColor"
                     />
                     <path
                        d="M18.5001 6H8.7876C8.58869 6 8.39792 5.92098 8.25727 5.78033C8.11662 5.63968 8.0376 5.44891 8.0376 5.25C8.0376 5.05109 8.11662 4.86032 8.25727 4.71967C8.39792 4.57902 8.58869 4.5 8.7876 4.5H19.2501C19.449 4.5 19.6398 4.57902 19.7804 4.71967C19.9211 4.86032 20.0001 5.05109 20.0001 5.25V15.75C20.0001 15.9489 19.9211 16.1397 19.7804 16.2803C19.6398 16.421 19.449 16.5 19.2501 16.5C19.0512 16.5 18.8604 16.421 18.7198 16.2803C18.5791 16.1397 18.5001 15.9489 18.5001 15.75V6Z"
                        fill="currentColor"
                     />
                  </svg>
               </div>
               <div className="inverted-img">
                  <img src={img} alt="img" />
               </div>
            </div>

            <div className="comments-scroll-container h-[634px] overflow-hidden">
               <div className="comments-scroll-content">
                  {duplicatedComments.map((c, i) => (
                     <div key={i} className="relative mb-10">
                        <div className="inverted-cards relative z-10">
                           <div className="absolute top-8 left-8 flex gap-1">
                              {[...Array(5)].map((_, idx) => (
                                 <img key={idx} src={star} alt="star" />
                              ))}
                           </div>
                           <p className="absolute top-16 left-8 text-base font-[400] max-w-[400px]">{c.text}</p>
                           <div className="absolute top-48 left-8 flex gap-5">
                              <img className="w-12 h-12 object-cover rounded-full" src={c.img} alt={c.name} />
                              <div>
                                 <p className="text-[14px] font-[600]">{c.name}</p>
                                 <span className="text-[12px] font-[400]">{c.role}</span>
                              </div>
                           </div>
                        </div>

                        <svg className="quote-svg" viewBox="0 0 90 90" fill="none" xmlns="http://www.w3.org/2000/svg">
                           {" "}
                           <rect width="90" height="90" rx="45" fill="#6A1FCC" />{" "}
                           <mask id="path-2-outside-1_528_69155" maskUnits="userSpaceOnUse" x="25" y="25" width="42" height="36" fill="black">
                              {" "}
                              <rect fill="white" x="25" y="25" width="42" height="36" />{" "}
                              <path d="M49.5 58.2L55.3 36L56.9 43.5C54.5667 43.5 52.6333 42.7667 51.1 41.3C49.5667 39.8333 48.8 37.8667 48.8 35.4C48.8 32.9333 49.5667 30.9333 51.1 29.4C52.6333 27.9333 54.5333 27.2 56.8 27.2C59.2 27.2 61.1667 27.9667 62.7 29.5C64.2333 31.0333 65 33 65 35.4C65 36.2 64.9667 36.9333 64.9 37.6C64.7667 38.3333 64.5333 39.2 64.2 40.2C63.8667 41.2 63.4 42.4667 62.8 44L57.5 58.2H49.5ZM28.3 58.2L34.1 36L35.7 43.5C33.3667 43.5 31.4333 42.7667 29.9 41.3C28.3667 39.8333 27.6 37.8667 27.6 35.4C27.6 32.9333 28.3667 30.9333 29.9 29.4C31.4333 27.9333 33.3333 27.2 35.6 27.2C38 27.2 39.9667 27.9667 41.5 29.5C43.0333 31.0333 43.8 33 43.8 35.4C43.8 36.2 43.7667 36.9333 43.7 37.6C43.5667 38.3333 43.3333 39.2 43 40.2C42.6667 41.2 42.2 42.4667 41.6 44L36.3 58.2H28.3Z" />{" "}
                           </mask>{" "}
                           <path
                              d="M49.5 58.2L47.5649 57.6945L46.9103 60.2H49.5V58.2ZM55.3 36L57.256 35.5827L53.365 35.4944L55.3 36ZM56.9 43.5V45.5H59.3717L58.856 43.0827L56.9 43.5ZM51.1 29.4L49.7176 27.9547L49.7015 27.9701L49.6858 27.9858L51.1 29.4ZM62.7 29.5L64.1142 28.0858L62.7 29.5ZM64.9 37.6L66.8677 37.9578L66.8821 37.8788L66.8901 37.799L64.9 37.6ZM64.2 40.2L66.0974 40.8325L64.2 40.2ZM62.8 44L60.9375 43.2712L60.9318 43.2859L60.9263 43.3006L62.8 44ZM57.5 58.2V60.2H58.8883L59.3737 58.8994L57.5 58.2ZM28.3 58.2L26.365 57.6945L25.7103 60.2H28.3V58.2ZM34.1 36L36.056 35.5827L32.165 35.4944L34.1 36ZM35.7 43.5V45.5H38.1717L37.656 43.0827L35.7 43.5ZM29.9 29.4L28.5176 27.9547L28.5015 27.9701L28.4858 27.9858L29.9 29.4ZM43.7 37.6L45.6677 37.9578L45.6821 37.8788L45.6901 37.799L43.7 37.6ZM41.6 44L39.7375 43.2712L39.7318 43.2859L39.7263 43.3006L41.6 44ZM36.3 58.2V60.2H37.6883L38.1737 58.8994L36.3 58.2ZM49.5 58.2L51.435 58.7056L57.235 36.5056L55.3 36L53.365 35.4944L47.5649 57.6945L49.5 58.2ZM55.3 36L53.344 36.4173L54.944 43.9173L56.9 43.5L58.856 43.0827L57.256 35.5827L55.3 36ZM56.9 43.5V41.5C55.0257 41.5 53.605 40.9284 52.4824 39.8547L51.1 41.3L49.7176 42.7453C51.6617 44.6049 54.1076 45.5 56.9 45.5V43.5ZM51.1 41.3L52.4824 39.8547C51.4083 38.8273 50.8 37.4174 50.8 35.4H48.8H46.8C46.8 38.3159 47.725 40.8394 49.7176 42.7453L51.1 41.3ZM48.8 35.4H50.8C50.8 33.3844 51.4086 31.9199 52.5142 30.8142L51.1 29.4L49.6858 27.9858C47.7248 29.9468 46.8 32.4823 46.8 35.4H48.8ZM51.1 29.4L52.4824 30.8453C53.6165 29.7605 55.0097 29.2 56.8 29.2V27.2V25.2C54.057 25.2 51.6501 26.1062 49.7176 27.9547L51.1 29.4ZM56.8 27.2V29.2C58.7317 29.2 60.1693 29.7977 61.2858 30.9142L62.7 29.5L64.1142 28.0858C62.1641 26.1356 59.6683 25.2 56.8 25.2V27.2ZM62.7 29.5L61.2858 30.9142C62.4023 32.0307 63 33.4683 63 35.4H65H67C67 32.5317 66.0644 30.0359 64.1142 28.0858L62.7 29.5ZM65 35.4H63C63 36.1458 62.9689 36.8117 62.9099 37.401L64.9 37.6L66.8901 37.799C66.9645 37.055 67 36.2542 67 35.4H65ZM64.9 37.6L62.9323 37.2422C62.8212 37.8531 62.6172 38.6238 62.3026 39.5675L64.2 40.2L66.0974 40.8325C66.4494 39.7763 66.7121 38.8135 66.8677 37.9578L64.9 37.6ZM64.2 40.2L62.3026 39.5675C61.9843 40.5225 61.5311 41.7542 60.9375 43.2712L62.8 44L64.6625 44.7288C65.2689 43.1792 65.749 41.8775 66.0974 40.8325L64.2 40.2ZM62.8 44L60.9263 43.3006L55.6263 57.5007L57.5 58.2L59.3737 58.8994L64.6737 44.6994L62.8 44ZM57.5 58.2V56.2H49.5V58.2V60.2H57.5V58.2ZM28.3 58.2L30.2351 58.7056L36.035 36.5056L34.1 36L32.165 35.4944L26.365 57.6945L28.3 58.2ZM34.1 36L32.144 36.4173L33.744 43.9173L35.7 43.5L37.656 43.0827L36.056 35.5827L34.1 36ZM35.7 43.5L35.7 41.5C33.8257 41.5 32.405 40.9284 31.2824 39.8547L29.9 41.3L28.5176 42.7453C30.4617 44.6049 32.9076 45.5 35.7 45.5V43.5ZM29.9 41.3L31.2824 39.8547C30.2083 38.8273 29.6 37.4174 29.6 35.4H27.6H25.6C25.6 38.3159 26.525 40.8394 28.5176 42.7453L29.9 41.3ZM27.6 35.4H29.6C29.6 33.3844 30.2086 31.9199 31.3142 30.8142L29.9 29.4L28.4858 27.9858C26.5248 29.9468 25.6 32.4823 25.6 35.4H27.6ZM29.9 29.4L31.2824 30.8453C32.4165 29.7605 33.8097 29.2 35.6 29.2V27.2V25.2C32.857 25.2 30.4501 26.1062 28.5176 27.9547L29.9 29.4ZM35.6 27.2V29.2C37.5317 29.2 38.9693 29.7977 40.0858 30.9142L41.5 29.5L42.9142 28.0858C40.9641 26.1356 38.4683 25.2 35.6 25.2V27.2ZM41.5 29.5L40.0858 30.9142C41.2023 32.0307 41.8 33.4683 41.8 35.4H43.8H45.8C45.8 32.5317 44.8644 30.0359 42.9142 28.0858L41.5 29.5ZM43.8 35.4H41.8C41.8 36.1458 41.7689 36.8117 41.7099 37.401L43.7 37.6L45.6901 37.799C45.7645 37.055 45.8 36.2542 45.8 35.4H43.8ZM43.7 37.6L41.7323 37.2422C41.6212 37.8531 41.4172 38.6238 41.1026 39.5675L43 40.2L44.8974 40.8325C45.2494 39.7763 45.5121 38.8135 45.6677 37.9578L43.7 37.6ZM43 40.2L41.1026 39.5675C40.7843 40.5225 40.3311 41.7542 39.7375 43.2712L41.6 44L43.4625 44.7288C44.0689 43.1792 44.549 41.8775 44.8974 40.8325L43 40.2ZM41.6 44L39.7263 43.3006L34.4263 57.5007L36.3 58.2L38.1737 58.8994L43.4737 44.6994L41.6 44ZM36.3 58.2V56.2H28.3V58.2V60.2H36.3V58.2Z"
                              fill="white"
                              mask="url(#path-2-outside-1_528_69155)"
                           />{" "}
                        </svg>
                     </div>
                  ))}
               </div>
            </div>
         </div>
      </section>
   );
}

export default Comments;
